Revit 2027 API
NumberingSchema.FilterCompatibleOutputParameters Method
 Returns the subset of input parameters that are valid as numbering output parameters for the specified categories or filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<NumberingParameter> FilterCompatibleOutputParameters(
	Document document,
	ISet<NumberingParameter> parameters,
	ISet<ElementId> categories,
	ElementId filterId
)
Public Shared Function FilterCompatibleOutputParameters (
	document As Document,
	parameters As ISet(Of NumberingParameter),
	categories As ISet(Of ElementId),
	filterId As ElementId
) As ISet(Of NumberingParameter)
public:
static ISet<NumberingParameter^>^ FilterCompatibleOutputParameters(
	Document^ document,
	ISet<NumberingParameter^>^ parameters,
	ISet<ElementId^>^ categories,
	ElementId^ filterId
)
static member FilterCompatibleOutputParameters :
        document : Document *
        parameters : ISet<NumberingParameter> *
        categories : ISet<ElementId> *
        filterId : ElementId -> ISet<NumberingParameter>
Parameters
document Document
 Revit Document.
parameters ISet<NumberingParameter>
 # Parameters to evaluate
categories ISet<ElementId>
 Set of categories for the parameter.
filterId ElementId
 Filter that determines that will determine the scope. If a valid filterId is provided the categories are ignored.
Return Value
ISet<NumberingParameter>
 Returns true if the parameter can be a numbering output parameter for the input categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace